Revit 2027 API
ParameterTypeId.SketchingLockAlignment Property
 "Lock"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SketchingLockAlignment { get; }
Public Shared ReadOnly Property SketchingLockAlignment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SketchingLockAlignment {
	ForgeTypeId^ get ();
}
static member SketchingLockAlignment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace